[
    {
        "id": 1,
        "jobTitle": "HR OFFICER",
        "location": "MANCHESTER .",
        "hours": "37.5 hours Weekly ",
        "ctc": "£24,000 – £27,000 (PA)",
        "experience": "1-3 Years",
        "publishTime": "2023-09-12",
        "description": "We are looking for a skilled HR Officer who will recruit, support and develop talent through developing policies and managing procedures. You will be responsible for administrative tasks and you’ll contribute to making the company a better place to work. If you are passionate about HR and highly efficient, give us a chance to meet you. We expect you to have knowledge of various HR functions. We want to see a committed and approachable individual and be impressed with your character and skills. The goal will be to provide excellent assistance and support to employees and managers.",
        "responsibilities": [
            "Support the development and implementation of HR initiatives and systems",
            "Provide counseling on policies and procedures",
            "Be actively involved in recruitment by preparing job descriptions, posting ads and managing the hiring process",
            "Create and implement effective onboarding plans",
            "Develop training and development programs",
            "Assist in performance management processes",
            "Support the management of disciplinary and grievance issues",
            "Maintain employee records (attendance, EEO data etc.) according to policy and legal requirements",
            "Review employment and working conditions to ensure legal compliance"
        ],
        "requirements": [
            "Proven experience as HR officer, administrator or other HR position",
            "Knowledge of HR functions (pay & benefits, recruitment, training & development etc.)",
            "Understanding of labor laws and disciplinary procedures",
            "Proficient in MS Office; knowledge of HRMS is a plus",
            "Outstanding organizational and time-management abilities",
            "Excellent communication and interpersonal skills",
            "Problem-solving and decision-making aptitude",
            "Strong ethics and reliability",
            "Minimum Bachelor Degree in any business discipline, social studies or relevant field; further training will be a plus"
        ]
    },
    {
        "id": 2,
        "jobTitle": "OFFICE MANAGER",
        "location": "MANCHESTER .",
        "hours": "37.5 hours Weekly ",
        "ctc": "£24,000 – £27,000 (PA)",
        "experience": "1-3 Years",
        "publishTime": "2023-09-12",
        "description": "We are looking for an Office Manager to organize and coordinate administration duties and office procedures. Your role is to create and maintain a pleasant work environment, ensuring high levels of organizational effectiveness, communication and safety. Office manager duties and responsibilities include scheduling meetings and appointments, making office supplies arrangements, greeting visitors and providing general administrative support to our employees. Previous experience as a Front Office Manager or Office Administrator would be an advantage. A successful Office Manager should also have experience with a variety of office software (email tools, spreadsheets and databases) and be able to accurately handle administrative duties. Ultimately, the Office manager should be able to ensure the smooth running of the office and help to improve company procedures and day-to-day operation.",
        "responsibilities": [
            "Serve as the point person for office manager duties including: Maintenance , Mailing , Supplies, Equipment, Bills , Errands , Shopping",
            "Schedule meetings and appointments",
            "Organize the office layout and order stationery and equipment",
            "Maintain the office condition and arrange necessary repairs",
            "Partner with HR to update and maintain office policies as necessary",
            "Organize office operations and procedures",
            "Coordinate with IT department on all office equipment",
            "Ensure that all items are invoiced and paid on time",
            "Manage contract and price negotiations with office vendors, service providers and office lease",
            "Manage office G&A budget, ensure accurate and timely reporting",
            "Provide general support to visitors",
            "Assist in the onboarding process for new hires",
            "Address employees queries regarding office management issues (e.g. stationery, Hardware and travel arrangements)",
            "Liaise with facility management vendors, including cleaning, catering and security services",
            "Plan in-house or off-site activities, like parties, celebrations and conferences"
        ],
        "requirements": [
            "Proven experience as an Office Manager, Front Office Manager or Administrative Assistant",
            "Knowledge of Office Administrator responsibilities, systems and procedures",
            "Proficiency in MS Office (MS Excel and MS Outlook, in particular)",
            "Hands on experience with office machines (e.g. fax machines and printers)",
            "Familiarity with email scheduling tools, like Email Scheduler and Boomerang",
            "Excellent time management skills and ability to multi-task and prioritize work",
            "Attention to detail and problem solving skills",
            "Excellent written and verbal communication skills",
            "Strong organizational and planning skills in a fast-paced environment",
            "A creative mind with an ability to suggest improvements",
            "Minimum Bachelor Degree in any business discipline, social studies or relevant field; further training will be a plus"
        ]
    },
    {
        "id": 3,
        "jobTitle": "MARKETING ADMINISTRATOR",
        "location": "MANCHESTER .",
        "hours": "37.5 hours Weekly ",
        "ctc": "£24,000 – £27,000 (PA)",
        "experience": "1-3 Years",
        "publishTime": "2023-09-12",
        "description": "We are seeking a dynamic Marketing Administrator to take charge of all marketing initiatives, including social media, digital campaigns, advertising, and creative projects. As the Head of Marketing, you will be responsible for creating strategic plans to establish and enhance our brand presence, allocating resources to different projects, and setting both short-term and long-term goals for the department. We are looking for a talented marketing strategist who can inspire team members and drive success. In this role, you will lead our Marketing department to maximize profitability and enhance competitiveness in the market. If you are a visionary leader with a passion for marketing, we invite you to join our team and make a significant impact.",
        "responsibilities": [
            "Craft strategies for all Marketing teams, including Digital, Advertising, Communications and Creative",
            "Prepare and manage monthly, quarterly and annual budgets for the Marketing department",
            "Set, monitor and report on team goals",
            "Design branding, positioning and pricing strategies",
            "Ensure our brand message is strong and consistent across all channels and marketing efforts (like events, email campaigns, web pages and promotional material)",
            "Analyze consumer behavior and determine customer personas",
            "Identify opportunities to reach new market segments and expand market share",
            "Craft quarterly and annual hiring plans",
            "Monitor competition (acquisitions, pricing changes and new products and features)",
            "Coordinate sales and marketing efforts to boost brand awareness",
            "Participate in the quarterly and annual planning of company objectives"
        ],
        "requirements": [
            "Work experience in  Marketing, preferably within our industry",
            "Experience running successful marketing campaigns",
            "Leadership skills with the ability to set and prioritize goals",
            "Analytical mind",
            "Proficiency in English",
            "Minimum Bachelor Degree in any business discipline, social studies or relevant field; further training will be a plus"
        ]
    },
    {
        "id": 4,
        "jobTitle": "CUSTOMER SERVICE MANAGER",
        "location": "MANCHESTER .",
        "hours": "37.5 hours Weekly ",
        "ctc": "£24,000 – £27,000 (PA)",
        "experience": "1-3 Years",
        "publishTime": "2023-09-12",
        "description": "We are looking for an experienced Customer Service Manager to provide excellent customer service and to promote this idea throughout the organisation. The goal is to keep the department running in an efficient and profitable manner, to increase customer satisfaction, loyalty and retention and to meet their expectations.",
        "responsibilities": [
            "Improve customer service experience, create engaged customers and facilitate organic growth",
            "Take ownership of customers issues and follow problems through to resolution",
            "Set a clear mission and deploy strategies focused towards that mission",
            "Develop service procedures, policies and standards",
            "Keep accurate records and document customer service actions and discussions",
            "Analyse statistics and compile accurate reports",
            "Recruit, mentor and develop customer service agents and nurture an environment where they can excel through encouragement and empowerment",
            "Keep ahead of industry’s developments and apply best practices to areas of improvement",
            "Control resources and utilise assets to achieve qualitative and quantitative targets",
            "Adhere to and manage the approved budget",
            "Maintain an orderly workflow according to priorities"
        ],
        "requirements": [
            "Proven working experience as a Customer Service Manager, Retail Manager or Assistant Manager",
            "Experience in providing customer service support",
            "Excellent knowledge of management methods and techniques",
            "Proficiency in English",
            "Working knowledge of customer service software, databases and tools",
            "Awareness of industry’s latest technology trends and applications",
            "Ability to think strategically and to lead",
            "Strong client-facing and communication skills",
            "Advanced troubleshooting and multi-tasking skills ",
            "Minimum Bachelor Degree in any business discipline, social studies or relevant field; further training will be a plus"
        ]
    }
]